Revit 2027 API
ViewDisplayBackground.CreateSky Method
 Creates an object that can be passed to View.SetBackground method to set the background of the SunAndClouds type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ViewDisplayBackground CreateSky()
Public Shared Function CreateSky As ViewDisplayBackground
public:
static ViewDisplayBackground^ CreateSky()
static member CreateSky : unit -> ViewDisplayBackground
Return Value
ViewDisplayBackground
 New background object to pass to View.SetBackground.
See Also
Reference
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace